diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ДатаОкончания) ИЛИ НЕ ЗначениеЗаполнено(Строка.ДатаНачала) Тогда
			Продолжить;
		КонецЕсли;
			Строка.ДнейВОтпуске = Цел((Строка.ДатаОкончания - Строка.ДатаНачала) / 86400);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище());
	ПараметрыОткрытия.Вставить("Адрес2", ПоместитьВоВременноеХранилище(Объект.Год, УникальныйИдентификатор));
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыОткрытия, ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	
	ТабЗнач = Объект.ОтпускаСотрудников.Выгрузить();
	Адрес = ПоместитьВоВременноеХранилище(ТабЗнач, УникальныйИдентификатор);
	Возврат Адрес;

КонецФункции

#КонецОбласти
